public class Day2 {
    // 캐멀 스타일
    // 코드 작성 시 여러 단어를 혼합하여 명명하는 경우,
    // 마치 낙타의 등처럼 대소문자를 섞어 작성하는 스타일이다.
    // 코드의 가독성 향상을 위해 사용되며, 자바 소스 파일명과 변수명을 작성할때 관례적으로 사용한다.

    /*

    1. 자바 소스 파일명(클래스명)은 대문자로 시작하는 것이 관례
    Week.java
    TeamMember.java
    public class Team { }

    2. 변수명은 소문자로 시작하는 것이 관례
    int score;
    int totalScore = 22;
    char teamRank = 'A';

    */

    // 변수 선언

    /*
    
    변수 선언에 필요한 것은 총 세 가지.
    1. 타입
    2. 변수명
    3. 세미콜른(;)

    세미콜론은 자바에서 모든 실행문 마지막에 필수적으로 달아줘야 한다.
    ";"을 달아줌으로써 컴파일러가 실행문을 인식하고 코드의 유효성을 판별한 뒤 실행하게 된다.

    일반적인 변수 선언은 다음과 같다.
    byte number;
    변수타입 / 변수명

    아직 값을 할당하지 않고 변수타입과 변수명만 지정해 놓은 것을 변수 선언이라고 한다.
    여기서 알아두어야 할 것은 변수 선언은 값의 타입과 이름만 결정한 것이지, 아직 메모리에 할당된 것은 아니다.
    
    */
}
